[
  {
    "id": 1,
    "title": "1984",
    "author": "Джордж Оруэлл",
    "cover": "../data/books/dystopia.jpg",
    "description": "Культовая антиутопия, изображающая тоталитарное общество под властью Большого Брата. Главный герой Уинстон Смит работает в Министерстве правды, где переписывает историю в угоду партии. Его тайный бунт против системы и любовь к Джулии приводят к трагическим последствиям. Роман исследует темы контроля сознания, подавления личности и манипуляции языком через «новояз».",
    "pages": 328,
    "genre": "Антиутопия",
    "rating": 4.8
  },
  {
    "id": 2,
    "title": "Мастер и Маргарита",
    "author": "Михаил Булгаков",
    "cover": "../data/books/master_and_margarita.jpg",
    "description": "Мистический шедевр, сочетающий сатиру на советскую действительность 1930-х годов с философской притчей о добре и зле. Дьявол в образе профессора Воланда посещает Москву, разоблачая человеческие пороки. Параллельно разворачивается история любви Мастера, автора романа о Понтии Пилате, и Маргариты, готовой ради возлюбленного заключить сделку с самим Сатаной. Роман наполнен библейскими аллюзиями и сложной символикой.",
    "pages": 384,
    "genre": "Мистика",
    "rating": 4.9
  },
  {
    "id": 3,
    "title": "Тихий Дон",
    "author": "Михаил Шолохов",
    "cover": "../data/books/quiet_flows_don.jpg",
    "description": "Эпическое полотно о жизни донского казачества в переломный период Гражданской войны. Центральный герой Григорий Мелехов метается между красными и белыми, теряя близких и ища правду среди кровавого хаоса. Любовная линия с Аксиньей и законной женой Натальей добавляет трагизма. Роман отличается детальными батальными сценами и глубоким психологизмом. Нобелевская премия по литературе 1965 года.",
    "pages": 1500,
    "genre": "Исторический роман",
    "rating": 4.7
  },
  {
    "id": 4,
    "title": "Преступление и наказание",
    "author": "Фёдор Достоевский",
    "cover": "../data/books/crime_and_punishment.jpg",
    "description": "Психологическая драма о бывшем студенте Раскольникове, совершившем убийство старухи-процентщицы по теории о «тварях дрожащих и право имеющих». Муки совести, допросы следователя Порфирия Петровича и дружба с проституткой Соней Мармеладовой приводят героя к очищению через страдание. Роман исследует границы морали и природу человеческой совести.",
    "pages": 430,
    "genre": "Классика",
    "rating": 4.8
  },
  {
    "id": 5,
    "title": "Анна Каренина",
    "author": "Лев Толстой",
    "cover": "../data/books/anna_karenina.jpg",
    "description": "История страстной любви замужней Анны Карениной к офицеру Вронскому, приведшей к социальному остракизму и трагическому финалу. Параллельно развивается сюжет о Левине, alter ego Толстого, ищущего смысл жизни в семье и труде на земле. Роман раскрывает контраст между ложью светского общества и подлинными чувствами. Знаменитая фраза «Все счастливые семьи похожи друг на друга...» открывает произведение.",
    "pages": 864,
    "genre": "Реализм",
    "rating": 4.9
  },
  {
    "id": 6,
    "title": "Братья Карамазовы",
    "author": "Фёдор Достоевский",
    "cover": "../data/books/karamazov.jpg",
    "description": "Последний и самый масштабный роман Достоевского, где через историю семьи Карамазовых исследуются вечные вопросы веры, свободы и морали. Интеллектуал Иван, страстный Дмитрий и кроткий Алёша воплощают разные грани русской души. Убийство отца Фёдора Павловича и суд над Дмитрием становятся поводом для философских диалогов о Боге и человеке. «Легенда о Великом Инквизиторе» — кульминация романа.",
    "pages": 840,
    "genre": "Философский роман",
    "rating": 4.9
  },
  {
    "id": 7,
    "title": "Доктор Живаго",
    "author": "Борис Пастернак",
    "cover": "../data/books/doctor_zhivago.jpg",
    "description": "Роман-эпопея о судьбе поэта и врача Юрия Живаго на фоне революций и Гражданской войны. Любовь к Ларе переплетается с размышлениями о природе творчества и месте человека в истории. Стихотворения Живаго, включённые в книгу, стали классикой русской поэзии. Запрещённый в СССР, роман был издан в Италии и принёс Пастернаку Нобелевскую премию (1958), от которой он вынужден был отказаться.",
    "pages": 592,
    "genre": "Исторический роман",
    "rating": 4.6
  },
  {
    "id": 8,
    "title": "Война и мир",
    "author": "Лев Толстой",
    "cover": "../data/books/war_and_peace.jpg",
    "description": "Эпическое полотно о России эпохи Наполеоновских войн, сочетающее исторические хроники с глубоким анализом человеческих характеров. Судьбы Пьера Безухова, Андрея Болконского и Наташи Ростовой переплетаются на фоне Бородинского сражения и пожара Москвы. Толстой развенчивает «великих людей» теории, показывая, как история творится миллионами обычных действий. Философские главы о природе войны дополняют сюжет.",
    "pages": 1300,
    "genre": "Эпопея",
    "rating": 4.9
  },
  {
    "id": 9,
    "title": "Сто лет одиночества",
    "author": "Габриэль Гарсиа Маркес",
    "cover": "../data/books/100_years.jpg",
    "description": "Символическая история рода Буэндиа в вымышленном городе Макондо, где магия переплетается с реальностью. Основатель династии Хосе Аркадио Буэндиа и его потомки обречены на повторение судеб и одиночество. Роман наполнен чудесными событиями: летающими коврами, воскрешениями, пророчествами цыгана Мелькиадеса. Яркий образец «магического реализма», повлиявший на мировую литературу. Нобелевская премия 1982 года.",
    "pages": 416,
    "genre": "Магический реализм",
    "rating": 4.8
  },
  {
    "id": 10,
    "title": "Лолита",
    "author": "Владимир Набоков",
    "cover": "../data/books/lolita.jpg",
    "description": "Скандальный роман о трагической страсти профессора Гумберта к 12-летней Долорес Гейз. Написанный как исповедь главного героя, текст гипнотизирует виртуозным языком, превращая неприемлемое в эстетический феномен. Дорогие мотели, бесконечные путешествия по Америке и фигура Куильти создают атмосферу болезненной одержимости. Роман поднимает вопросы искусства, морали и ответственности рассказчика.",
    "pages": 336,
    "genre": "Психологический роман",
    "rating": 4.5
  }
]
